[
  {
    "title": "Wynn Al Marjan Island: первый игровой курорт в ОАЭ откроется в 2027 году",
    "description": "Строительство роскошного курорта Wynn Al Marjan Island в эмирате Рас-Аль-Хайма идёт по графику. Генеральный директор девелопера Marjan, Абдулла Аль Абдоули, подтвердил, что открытие объекта запланировано на март 2027 года. По его словам, стройка активно продвигается, и уже сегодня видно масштаб предстоящего проекта.",
    "imageUrl": "https://images.unsplash.com/photo-1512453979798-5ea266f8880c?w=1200&h=800&fit=crop",
    "contents": [
      {
        "type": "text",
        "title": "Вступ",
        "description": "Строительство роскошного курорта Wynn Al Marjan Island в эмирате Рас-Аль-Хайма идёт по графику. Генеральный директор девелопера Marjan, Абдулла Аль Абдоули, подтвердил, что открытие объекта запланировано на март 2027 года. По его словам, стройка активно продвигается, и уже сегодня видно масштаб предстоящего проекта.\nПервый интегрированный игровой курорт в ОАЭ\nWynn Al Marjan Island станет первым интегрированным игровым курортом в Объединённых Арабских Эмиратах и на Ближнем Востоке. Проект реализуется в партнёрстве между Wynn Resorts, RAK Hospitality Holding и Marjan.\nВысота здания достигнет 70 этажей, из которых уже возведено 61. Инвестиции в строительство составляют 3,9 миллиарда долларов, а сам курорт занимает более 60 гектаров на собственном острове в Персидском заливе.\nАрхитектура, инфраструктура и влияние на экономику\nWynn Al Marjan Island предложит 1 542 номера класса люкс, более 22 ресторанов и лаунж-зон, а также масштабные площадки для отдыха и развлечений.\nПроект станет важным драйвером экономического роста Рас-Аль-Хаймы:\n– увеличит поток международных туристов;\n– создаст сотни новых рабочих мест;\n– усилит инвестиционную привлекательность региона.\nДля поддержки курорта в окрестностях будут построены жилые комплексы и коммерческие объекты, что откроет новые возможности для инвестиций в недвижимость Рас-Аль-Хаймы и Дубая.\nНовый этап развития туризма и инвестиций\nПомимо игровых площадок, Wynn Al Marjan Island предложит широкий выбор развлечений, гастрономических направлений и премиальных услуг. Курорт станет полноценным центром отдыха мирового уровня, который привлечёт внимание туристов, инвесторов и деловых партнёров со всего мира.\nПерспективы рынка недвижимости\nЗапуск Wynn Al Marjan Island укрепит позиции Рас-Аль-Хаймы как нового инвестиционного центра ОАЭ. Рост туризма и развитие инфраструктуры создают высокий потенциал для покупки и аренды недвижимости в регионе, особенно в премиум-сегменте.\nХотите инвестировать в недвижимость рядом с Wynn Al Marjan Island? Свяжитесь с нашим экспертом по недвижимости в Дубае и получите индивидуальную консультацию.",
        "order": 0
      }
    ]
  },
  {
    "title": "Дубай — мировой лидер по прямым иностранным инвестициям в 2025 году",
    "description": "Дубай подтверждает свой статус глобального инвестиционного хаба. По данным fDi Markets (Financial Times Ltd), город в восьмой раз подряд занимает первое место в мире по проектам формата Greenfield.",
    "imageUrl": "https://images.unsplash.com/photo-1512917774080-9991f1c4c750?w=1200&h=800&fit=crop",
    "contents": [
      {
        "type": "text",
        "title": "Вступ",
        "description": "Дубай подтверждает свой статус глобального инвестиционного хаба. По данным fDi Markets (Financial Times Ltd), город в восьмой раз подряд занимает первое место в мире по проектам формата Greenfield.\nИтоги первого полугодия 2025 года\n643 проекта Greenfield — рекорд с 2003 года;\nПриток прямых иностранных инвестиций: 40,4 млрд дирхамов (≈ $11 млрд), что на 62% больше по сравнению с 2024 годом;\nОбщее количество проектов: 1090 (+28,7%);\nСоздано рабочих мест: 38 433 (+46,7%).",
        "order": 0
      },
      {
        "type": "text",
        "title": "Продовження",
        "description": "Дополнительно:\n2-е место в мире по объему капитала Greenfield;\n3-е место по созданию рабочих мест;\n1-е место по количеству проектов штаб-квартир (+60% за год).",
        "order": 1
      },
      {
        "type": "text",
        "title": "Продовження",
        "description": "Лидирующие отрасли и сектора\nДубай демонстрирует сильные позиции в ИКТ, электронике, креативных индустриях, финтехе, AI, бионауках, транспорте, экотехнологиях и других секторах.\nТОП-отрасли по капиталу:\nбизнес-услуги;\nгостиничный и туристический сектор;\nтранспорт и логистика;\nпотребительские товары;\nнедвижимость.",
        "order": 2
      },
      {
        "type": "text",
        "title": "Продовження",
        "description": "Ключевые инвесторы\nСША — 35%;\nВеликобритания — 10,6%;\nФранция и Индия — по 8,9%;\nСаудовская Аравия — 5,2%.",
        "order": 3
      },
      {
        "type": "text",
        "title": "Продовження",
        "description": "Стратегия развития и доверие инвесторов\nПо словам наследного принца шейха Хамдана бен Мухаммеда, успехи Дубая отражают доверие инвесторов и стратегию D33, направленную на удвоение экономики города к 2033 году.\nДубай подтверждает лидерство в мире для инвесторов, предоставляя уникальные возможности для вложений и развития бизнеса.\nХотите узнать больше о возможностях инвестиций в ОАЭ? Свяжитесь с нашими экспертами по недвижимости и инвестициям в Дубае, чтобы получить консультацию и рекомендации.",
        "order": 4
      }
    ]
  }
]