[
  {
    "name": " Amaya Properties",
    "descriptionEn": "Amaya Properties focuses on development of residential, commercial and plotted real estate with strong emphasis on practical design, high quality construction and maintenance services support.",
    "needsTranslation": true
  },
  {
    "name": " Credo Investments",
    "descriptionEn": "Founded in 2005, Credo Investments FZE is one of Dubai’s leading developers in the luxury and premium real estate sector. The company is known for its innovative and creative approach to crafting homes that cater to the luxury lifestyle. Over the years, Credo has established itself as a provider of ...",
    "needsTranslation": true
  },
  {
    "name": "A S I Real Estate Development",
    "descriptionEn": "ASI LLC is a Commercial Real Estate Brokerage and Development Company that focuses on the emerging needs of Dubai’s Realty market. Their highly efficient team of service professionals and field brokers cater to the Leasing and Renting sector of Dubai’s Real Estate market. Their agents are RERA-certi...",
    "needsTranslation": true
  },
  {
    "name": "ADE Properties",
    "descriptionEn": "ADE Properties, a dynamic real estate development company, is part of the prestigious Al Dallal Group, a renowned Emirati business. Al Dallal Real Estate, the group's leasing division, specializes in renting out the properties owned by the group. With a rich history dating back to 1951, the group ha...",
    "needsTranslation": true
  },
  {
    "name": "AG Properties",
    "descriptionEn": "AG Properties & Arabian Gulf Properties are one of the top-tier luxury real estate developers in the Middle East. We are the most trusted real estate development group of companies for over 2 decades. AG Properties & Arabian Gulf Properties are committed to creating residential & commercial developm...",
    "needsTranslation": true
  },
  {
    "name": "AHAD Group",
    "descriptionEn": "Ahead Group, as an experienced developer in Dubai, is actively working to change the urban landscape by presenting unique and innovative facilities.Ahead Group employs dedicated and hardworking employees whose efforts are the key to the company's success. The main goal of the Azard Group is to provi...",
    "needsTranslation": true
  },
  {
    "name": "AHS Properties",
    "descriptionEn": "AHS Properties, established in early 2021, epitomises the pinnacle of sophistication and grandeur, showcasing an impressive property portfolio. A pioneering and visionary enterprise that embarked on its journey in the realm of ultra-luxury development. Fuelled by an unwavering passion for innovation...",
    "needsTranslation": true
  },
  {
    "name": "AJ Gargash",
    "descriptionEn": "AJ Gargash Real Estate Development is a pioneering developer in the UAE market, renowned for its commitment to excellence, innovation, and sustainability. Led by CEO Ali Gargash, the company excels in blending architectural brilliance with Emirati culture to create exceptional living spaces that set...",
    "needsTranslation": true
  },
  {
    "name": "AMBER Developments",
    "descriptionEn": "Being highly client-centric and quality focused drives everything we do. Amber's commitment to excellence sets each of our developments apart. Our sites are carefully chosen for their prime locations at immediate proximity to Dubai Downtown and their financial returns, while our materials and finish...",
    "needsTranslation": true
  },
  {
    "name": "AMIS Properties",
    "descriptionEn": "We blend innovative design, superior amenities, and prime locations to create a luxury real estate portfolio that exceeds expectations.​Design excellence has been at the core of AMIS since day one. Our commitment extends beyond mere project execution to redefining the concept of luxury living.​Impec...",
    "needsTranslation": true
  },
  {
    "name": "API",
    "descriptionEn": "Founded in 1985 and registered in Luxembourg, Alex Brown was among the first shareholders of the Group.& Sons, Banque Kleinwort Benson SA, Kredietbank, SA Luxembourgeoise, BHF Bank Group, ArabReinsurance Group (Bahrain), National Investments Co. (Kuwait) and State Street Research and Management Co.,...",
    "needsTranslation": true
  },
  {
    "name": "ARIB Developments",
    "descriptionEn": "ARIB Real Estate Development Company stands at the forefront of property innovation, offering luxury living experiences framed by breathtaking cityscapes. Our extensive expertise in the industry ensures each development exemplifies sophistication, comfort, and easy access to urban amenities.",
    "needsTranslation": true
  },
  {
    "name": "AUM Development",
    "descriptionEn": "AUM Developers — The Energy of Creation, Embodied in ArchitectureAUM — the primordial vibration that gave birth to the Universe. A symbol of unity, harmony, and the beginning of all existence.Inspired by this foundational energy, AUM Developers transforms ideas into living spaces where architecture ...",
    "needsTranslation": true
  },
  {
    "name": "AYAT Development",
    "descriptionEn": "AYAT Development is a leading real estate and construction firm dedicated to transforming urban landscapes. We specialize in land acquisition, project development, and completion, delivering high-quality residential, commercial, and industrial projects, including mega developments under the Sheikh Z...",
    "needsTranslation": true
  },
  {
    "name": "AYS Property Development",
    "descriptionEn": "AYS Developments is a leading property development company with proven expertise in real estate and lifestyle properties. With significant presence in several key global markets, we have a portfolio of exceptional properties in Russia and Finland.In the UAE, our mission is to create and deliver styl...",
    "needsTranslation": true
  },
  {
    "name": "Aark Developers",
    "descriptionEn": "Aark Developers is redefining the UAE's real estate landscape through their commitment to quality, innovation, and customer satisfaction. With over a decade of experience, they craft luxurious residential projects that set new benchmarks in design and construction. Each Aark project meets rigorous s...",
    "needsTranslation": true
  },
  {
    "name": "Abou Eid Real Estate Development",
    "descriptionEn": "Abou Eid Real Estate Development is a prominent and esteemed global leader in private development, renowned for its exceptional projects and innovative solutions. With a rich history spanning over three decades, the company has solidified its position as a reputable and trusted entity in the real es...",
    "needsTranslation": true
  },
  {
    "name": "Acube Developers",
    "descriptionEn": "As a customer-focused real estate developer, Acube is poised to revolutionize the property market in Dubai through strategic partnerships with leading businesses in the UAE. Our comprehensive real estate development solutions aim to enhance the quality of life and change mindsets. With an in-depth u...",
    "needsTranslation": true
  },
  {
    "name": "Ahmadyar Real Estate Development",
    "descriptionEn": "Ahmadyar Developments is a beacon of upscale lifestyle & innovation in the dynamic real estate development landscape. With roots tracing back to Ahmadyar Group's inception in 1992, this esteemed entity has paved the way into a distinguished company, extending its reach across Afghanistan. the UAE, T...",
    "needsTranslation": true
  },
  {
    "name": "Al Ali Property Investment",
    "descriptionEn": "Al Ali Property Investment (API) is a trusted developer in the UAE. The company constructs residential and commercial properties, creating modern urban communities. Each project stands out with high-quality construction, thoughtful architecture, and a comfortable living environment.API focuses on pr...",
    "needsTranslation": true
  },
  {
    "name": "Al Habtoor Group",
    "descriptionEn": "Al Habtoor Grouphas grown with the United Arab Emirates. What started out as a small engineering firm in 1970, is today one of the region’s most respected conglomerates with interests in the hospitality, automotive, real estate, education and publishing sectors. The Al Habtoor Group has earned itsel...",
    "needsTranslation": true
  },
  {
    "name": "Al Marina",
    "descriptionEn": "Al Marina Investment is a construction-related company operating in Dubai. Dedicated to building the urban community, its portfolio includes lucrative property investments like lifestyle, leisure and retail landmarks. They currently manage a number of assets within its portfolio and their expertise ...",
    "needsTranslation": true
  },
  {
    "name": "Al Mawared Properties",
    "descriptionEn": "Permit No. 2048846486Real Estate Permit Card on dubailad.gov.aeWe Are a Real Estate Developer Based in Dubai, UAE, Specializing in The Development of Luxury Residential, Hospitality and Commercial Properties, As Well As Mixed–Use Projects. Some Of Our Most Notable Developments Include Barari Hills R...",
    "needsTranslation": true
  },
  {
    "name": "Al Mizan",
    "descriptionEn": "Al Mizan is a development company based in Dubai, United Arab Emirates. The company specializes in real estate development, construction, and property management. They have completed several projects in Dubai, including residential and commercial buildings, hotels, and shopping centers. Al Mizan is ...",
    "needsTranslation": true
  },
  {
    "name": "Al Sayyah Group",
    "descriptionEn": "Al Sayyah Real Estate Group is a prominent real estate and investment company founded by Mohammed Alsayyah, a visionary leader with over 35 years of experience in the industry. His dedication to excellence and long-term planning has been instrumental in the success and growth of the group.Under his ...",
    "needsTranslation": true
  },
  {
    "name": "Al Seeb Real Estate Development",
    "descriptionEn": "Thanks to world-class service, first-class realtors and a firm belief that we can provide a wide range of research facilities at affordable prices, our professionalism and practical approach are embodied in projects that determine the future of real estate. Over the past 29 years, we have built a le...",
    "needsTranslation": true
  },
  {
    "name": "Al Waleed",
    "descriptionEn": "Al Waleed Development is a developer of premium properties with a focus on innovation, luxury and investment appeal. The company combines modern architectural solutions with high quality standards to offer clients exclusive residential and commercial projects.Developer's projects:- Al Waleed Garden ...",
    "needsTranslation": true
  },
  {
    "name": "Alaia Developments",
    "descriptionEn": "We aim to encompass and elevate lifestyles, ensuring a seamless blend of luxury, sustainability, and quality.With over two decades of investment expertise in the region, Alaia Developments is focused on expanding its portfolio of luxury real estate, setting new benchmarks in design, craftsmanship, s...",
    "needsTranslation": true
  },
  {
    "name": "Albait Al Duwaliy Real Estate Development",
    "descriptionEn": "Based in Dubai, Al Bait Al Duwaliy is more than a real estate development company. We are purveyors of possibility, with the vision and expertise to transform spaces into places of wonder.Combining art, innovation, and modern approaches, we work to the highest standards to deliver world-class projec...",
    "needsTranslation": true
  },
  {
    "name": "Almal",
    "descriptionEn": "Almal Investments operates as a dynamic investment and development firm based in Dubai, UAE. Specializing in lucrative projects within hospitality and residential sectors, the company draws upon extensive expertise in investments, real estate, and construction. Residential portfolio feature Harrison...",
    "needsTranslation": true
  },
  {
    "name": "Amali Properties",
    "descriptionEn": "Amali Properties is the leading developer offering best in class properties in UAE, where Amira and Ali Sajwani are the visionary minds behind reshaping the landscape of luxury living. Ali Sajwani, a seasoned entrepreneur, has not only thrived in the competitive startup arena but has also assumed a ...",
    "needsTranslation": true
  },
  {
    "name": "Amirah Developments",
    "descriptionEn": "Amirah Development is a newly established property development company based in Dubai, dedicated to redefining the city’s skyline with our visionary approach to real estate. Founded by Muhammad Yousuf Jafrani, a seasoned entrepreneur with over 15 years of experience in the UAE, Amirah Development br...",
    "needsTranslation": true
  },
  {
    "name": "Amwaj Development",
    "descriptionEn": "AMWAJ Development is a leading real estate developer in Dubai, pursuing its mission to provide innovative and environmentally friendly development solutions. With a focus on excellence and quality, AMWAJ Development strives to enhance the quality of life for both residents and visitors while making ...",
    "needsTranslation": true
  },
  {
    "name": "Anax Developments",
    "descriptionEn": "ANAX DevelopmentsAnchored in a strategic investment approach, we adhere to sound principles that guide our decisions, ensuring prudent and sustainable growth. Our customer focus is paramount, with a dedication to understanding and meeting the unique needs of each client. By harmonizing these element...",
    "needsTranslation": true
  },
  {
    "name": "Aqua",
    "descriptionEn": "Founded in 2005, AQUA Properties established its position on the market as a renowned, award-winning real estate company thanks to its innovative, creative and forward-thinking approach. Located in a modern, spacious oﬃce on Sheikh Zayed road, AQUA Properties oﬀers expert property advice with their ...",
    "needsTranslation": true
  },
  {
    "name": "Arabian Gulf Properties",
    "descriptionEn": "Arabian Gulf Properties is a distinguished real estate developer in the United Arab Emirates, renowned for its commitment to excellence and innovation in the construction and real estate sectors. Established in 1978, the company has evolved into a top-tier luxury real estate developer in the Middle ...",
    "needsTranslation": true
  },
  {
    "name": "Arada",
    "descriptionEn": "Conceptualized with the intention of delivering superior properties to the UAE real estate segment, ARADA will pursue the development and timely delivery of projects. The newly-established company will draw on the vast experience of its founding parties and the breadth of their diverse commercial po...",
    "needsTranslation": true
  },
  {
    "name": "Arady Properties",
    "descriptionEn": "Founded in 2007 and based in Abu Dhabi, Arady Properties P.S.C. has established itself as a leading entity in UAE's real estate sector. With a specialization in real estate development and investments, the company sets itself apart through its proactive engagement in partnerships and joint ventures....",
    "needsTranslation": true
  },
  {
    "name": "Arsenal East",
    "descriptionEn": "Since 1997, Arsenal has been setting standards of luxury and comfort in Europe and the Middle East. Our projects are not merely real estate; they are inspiring spaces where every detail is crafted with quality and harmony.",
    "needsTranslation": true
  },
  {
    "name": "Asak Real Estate Development",
    "descriptionEn": "Founded in 2006 by Mr. Ghaleb Al Sarraj, Al Serh Al Kabeer Construction Company is a trusted leader in construction and property development across the UAE and Saudi Arabia. With expertise spanning residential, commercial, and specialized projects, the company is driven by a commitment to excellence...",
    "needsTranslation": true
  },
  {
    "name": "Aura Infinite Real Estate Development ",
    "descriptionEn": "Aura Infinite Real Estate Development is a visionary company dedicated to redefining luxury living through innovative design and meticulous craftsmanship. Rooted in the belief that modern living should seamlessly blend sophistication with functionality, Aura Infinite creates exceptional properties t...",
    "needsTranslation": true
  },
  {
    "name": "Avelon Developments",
    "descriptionEn": "Avelon Developments specializes in crafting design-oriented apartments that offer a unique community lifestyle in Dubai. With a focus on premium amenities and sophisticated design, the goal is to redefine urban living. Influenced by an already-established family business in the UAE's real estate mar...",
    "needsTranslation": true
  },
  {
    "name": "Avenew Development",
    "descriptionEn": "Avenew Development integrates cutting-edge technology as a core element of its identity. The brand is dedicated to pushing beyond conventional boundaries, maintaining a forward-looking approach that anticipates future trends.",
    "needsTranslation": true
  },
  {
    "name": "Axiom Prime Real Estate",
    "descriptionEn": "Axiom Prime was born from over 60 years of combined experience in the Dubai shall luxury real estate market and targets high-end living. A worldwide adventure that has given life to homes marrying comfort and sophistication. They take great pride in quality, infusing a level of sophistication and el...",
    "needsTranslation": true
  },
  {
    "name": "Azizi",
    "descriptionEn": "Azizi Developments is a leading real estate and lifestyle developer in Dubai, UAE. The private company Azizi was founded in 2007 and has successfully developed and commissioned thousands of properties in various prestigious areas of Dubai. Azizi's main project locations include Al Furjan, near Expo ...",
    "needsTranslation": true
  },
  {
    "name": "B N H Real Estate Developer",
    "descriptionEn": "B.N.H Property Real Estate Development and Management is renowned for its innovative approach to urban real estate investment and management. Steered by the visionary leadership of its founder and CEO, Mr. Muhammad Nasir Muhammad Iqbal, in collaboration with Mr. Muhammad Bilal Muhammad Nasir, the fi...",
    "needsTranslation": true
  },
  {
    "name": "BAMX Development",
    "descriptionEn": "BAMX Developmentis a trusted name in the real estate sector, renowned for its intelligent investments and strategic approach to growth. Established with a vision to create well-designed spaces in prime locations, BAMX Development has earned the trust of both investors and residents. Their focus on q...",
    "needsTranslation": true
  },
  {
    "name": "BT Properties",
    "descriptionEn": "As Asia’s leading private real estate developer, Bahria Town (BT Properties) has spent 30 years transforming landscapes and shaping skylines with vision and expertise.Driven by a steadfast commitment to quality, we have delivered countless homes and developed extensive and significant infrastructure...",
    "needsTranslation": true
  },
  {
    "name": "Barco Developers",
    "descriptionEn": "Barco is a UAE-based real estate developer and part of Badami Holding Group, a diversified business group with 50 years of operations in the UAE and international markets. Founded by experienced operators with a background in real estate, finance, consulting, F&B, and manufacturing, Barco brings a d...",
    "needsTranslation": true
  },
  {
    "name": "Beyond",
    "descriptionEn": "BEYOND is a new developer of premium real estate, part of the OMNIYAT group of companies, which offers innovative solutions in the field of luxury housing construction. We strive to create homes where nature, luxury and modern technology combine. Our goal is to provide customers with not just a plac...",
    "needsTranslation": true
  },
  {
    "name": "Binghatti",
    "descriptionEn": "Binghatti is a major Emirati property development company, based in Dubai. It is one of the largest property development companies in the United Arab Emirates. The company is renowned for being the UAE’s leading residential developer of a luxury mid-market segments and high-end homes.",
    "needsTranslation": true
  },
  {
    "name": "Blanco Thornton",
    "descriptionEn": "Blanco Thornton is a real estate developer known for perfecting symphonies in the world of real estate. Their approach is centered around creating architecturally-inspired environments that promote overall well-being - nurturing the body, mind, and soul of residents. Their commitment to enhancing th...",
    "needsTranslation": true
  },
  {
    "name": "Bloom Heights Properties L.L.C",
    "descriptionEn": "Bloom Holding is one of the UAE’s leading companies dedicated to the development of modern, sustainable communities in the UAE. We are deeply committed to developing premium real estate and enriching the lives of residents by focusing on four core segments: real estate, education, services and hospi...",
    "needsTranslation": true
  },
  {
    "name": "BnW Developments",
    "descriptionEn": "BnW Developments specializes in premier real estate development, transforming visionary concepts into luxurious realities. Beyond real estate, BnW Developments excels in diverse investments, project and capital management, and forging strategic alliances, ensuring comprehensive androbust growth for ...",
    "needsTranslation": true
  },
  {
    "name": "Bold Living",
    "descriptionEn": "Shaping tomorrow’s skyline with bold vision. We are building more than spaces; we are also building our digital presence. A new Bold website is on its way.",
    "needsTranslation": true
  },
  {
    "name": "Bonyan International Investment Group",
    "descriptionEn": "Bonyan Group has been a pioneering force in developing the lucrative real estate market in the Gulf and MENA regions. Since entering the real estate market in 2002, which ultimately lead to the successful creation of Bonyan International Investment Group (Holding), the Company, along with its partne...",
    "needsTranslation": true
  },
  {
    "name": "C Fourteen",
    "descriptionEn": "C Fourteen is a construction-related company operating in Dubai.",
    "needsTranslation": true
  },
  {
    "name": "CDS Developments",
    "descriptionEn": "At CDS, we go beyond building structures, we create trust, comfort and belonging.Guided by global expertise, we’re here to redefine what living means in the UAE. Since 1999",
    "needsTranslation": true
  },
  {
    "name": "Calgary Properties",
    "descriptionEn": "Calgary Properties is a developer specializing in investment projects in Dubai. The company offers premium properties in the pre-launch stage, including apartments, townhouses, and villas. Their offerings are distinguished by contemporary design, high construction standards, and competitive pricing....",
    "needsTranslation": true
  },
  {
    "name": "Casa Vista & Golden Woods Developers",
    "descriptionEn": "Innovation in Design: Each project i s a symphony of innovation. blending architectural marvels with practical living solutions. Tailored t o You: Our client-centric approach ensures that your aspirations guide t h e development process, resulting in spaces that truly resonate with you. Unwavering Q...",
    "needsTranslation": true
  },
  {
    "name": "Casagrand",
    "descriptionEn": "Casagrand: Step into timeless comfort and refined luxury.Surround yourself with design that takes every detail into account, where your comfort is our priority, and privacy and exclusivity come together to make your stay a unique and authentic experience.",
    "needsTranslation": true
  },
  {
    "name": "Centurion Development",
    "descriptionEn": "Royal Centurion Real Estate Development is a construction-related company operating in Dubai. One of the well-known real estate developers in Dubai, who has established himself as one of the responsible developers in the Dubai real estate market through proper and consistent construction.",
    "needsTranslation": true
  },
  {
    "name": "Cirrera Development",
    "descriptionEn": "Cirrera Development is a new developer in Dubai with international construction experience since 2010. More than 20 completed projects in Moscow and St. Petersburg. The architectural and engineering team has experience in countries such as Italy, India, Azerbaijan, and Russia.Thanks to its own techn...",
    "needsTranslation": true
  },
  {
    "name": "Citi Developers",
    "descriptionEn": "With a legacy of over a decade, we proudly stand as a world-leading master developer, renowned for reshaping cityscapes and enriching communities across continents.At Citi, trust is our foundation, and experience, our currency. We understand how our residents and investors think, and we apply this k...",
    "needsTranslation": true
  },
  {
    "name": "City View Development",
    "descriptionEn": "City View Developments is an outstanding real estate development company with many years of experience in the residential, commercial and hotel sectors.Headquartered in the UAE and with significant operations in Turkey and Georgia, the company has a global presence covering about 5 million square fe...",
    "needsTranslation": true
  },
  {
    "name": "Condor",
    "descriptionEn": "The Condor Group was established in the UAE in 1980 and specializes in engineering and construction of prestigious residential and hospitality projects. For over 40 years, Condor has reimagined luxurious towers, hotels and hospitals that seamlessly support people’s lifestyles, with more than 400 suc...",
    "needsTranslation": true
  },
  {
    "name": "Confident Group",
    "descriptionEn": "Confident Group, a leading Indian real estate developer, distinguishes itself through an unwavering commitment to quality and meticulous attention to detail. Renowned for crafting exceptional residential, commercial, and hospitality projects, we take pride in creating spaces that reflect precision a...",
    "needsTranslation": true
  },
  {
    "name": "Consolidated Urban Real Estate Development",
    "descriptionEn": "Consolidated Urban Real Estate Development is a real estate development company with experience in the acquisition and development of commercial residential real estate in Dubai. Due to our deep understanding of the regional real estate market in Dubai, we are looking for low-cost properties to crea...",
    "needsTranslation": true
  },
  {
    "name": "Dalands Holding",
    "descriptionEn": "Since inception in 2005, We have earned our reputation as a leading Real Estate Developer in and around India. We pride ourselves on developing hi-end, luxurious buildings, always with elegance in our developments. Working with a strong team of industry leading professionals, we have a proven track ...",
    "needsTranslation": true
  },
  {
    "name": "Damac",
    "descriptionEn": "The private company DAMAC Properties has been operating in the residential real estate construction market in Dubai since 2002 as a division of the multidisciplinary enterprise DAMAC Group, founded back in 1982. DAMAC has been awarded numerous prestigious awards, in particular, as the best developer...",
    "needsTranslation": true
  },
  {
    "name": "Danube",
    "descriptionEn": "Danube Group has grown from a single store started in Deira, Dubai 30 years ago to one of the most trusted and household brand in the Middle-East. The multi-million dollar Group has been consistently increasing its global footprint and annual revenue supported by ever-growing family of over 3,500 st...",
    "needsTranslation": true
  },
  {
    "name": "Dar Al Arkan Properties",
    "descriptionEn": "Dar Al Arkan Properties L.L.C, a subsidiary of the Saudi Arabian real estate giant Dar Al Arkan Real Estate Development Company, is a prominent developer in Dubai's luxury property market. Renowned for its commitment to architectural excellence and innovation, the company collaborates with world-cla...",
    "needsTranslation": true
  },
  {
    "name": "Dar Al Karama",
    "descriptionEn": "At Dar Al Karama, we are more than just a real estate development company; we are a culmination of four decades of experience, a testament to family values, and a commitment to shaping the future of living spaces in Dubai. Established in 1985, our main business has been an integral part of Dubai's g...",
    "needsTranslation": true
  },
  {
    "name": "Dar Global",
    "descriptionEn": "Great ideas are born from great beliefs. We profoundly believe in the timeless value of luxury, a kind of wealth in constant growth for its own intrinsic nature, that represents one of the wisest and most foresighted investments of our changing times. Established in 2017 to upend the global luxury r...",
    "needsTranslation": true
  },
  {
    "name": "Deyaar",
    "descriptionEn": "Deyaar Development is the largest developer in the UAE market, which has many years of successful experience and a brilliant reputation. The richest people in the world invest in the implementation of the projects developed by her, because they know that if the specialists of this company take up th...",
    "needsTranslation": true
  },
  {
    "name": "Dubai International Financial Centre (DIFC)",
    "descriptionEn": "The Dubai International Financial Centre (DIFC) is a special economic zone in Dubai covering 110 ha (272 acres), established in 2004 as a financial hub for companies operating throughout the Middle East, Africa, and South Asia (MEASA) markets.DIFC is regulated by the Dubai Financial Services Authori...",
    "needsTranslation": true
  },
  {
    "name": "Dubai Properties",
    "descriptionEn": "Dubai Properties made a significant impact in 2016 by delivering over 3,000 residential units, with 2,900 of these located in the fast-growing Dubailand area, and 124 units nestled in the upscale Dubai Wharf. Each project reflects the developer's commitment to quality and the enhancement of urban li...",
    "needsTranslation": false
  },
  {
    "name": "Dubai South",
    "descriptionEn": "A hub for innovation with a progressive outlook towards the future, Dubai South was realisedas a continuation of the vision of His Highness Sheikh Mohammed bin Rashid Al Maktoum, Vice President and Prime Minister of the UAE and Ruler of Dubai, who dreamed a future for the emirate and paved a path to...",
    "needsTranslation": true
  },
  {
    "name": "Dubuild",
    "descriptionEn": "DUBUILD CONTRACTING LLC, is an EPC (Engineering, Procurement & Construction) Contracting Company established in 2008, specialized to provide complete construction solutions to a wide range of clients from design, execution & project.Great work is born when passion, energy and teamwork come together....",
    "needsTranslation": true
  },
  {
    "name": "Dugasta Properties Development",
    "descriptionEn": "Dugasta Properties Development is a promising and evolving developer from Dubai, United Arab Emirates. Over more than 30+ years in the real estate industry, the Chairman and Founder of Dugasta Properties Development, Mr. Tauseef Khan is an expert in the Real Estate Market. Backed by the longstanding...",
    "needsTranslation": true
  },
  {
    "name": "ENSO",
    "descriptionEn": "ENSO embodies modern sophistication in Dubai, blending luxury with sustainability in its residential offerings. Situated strategically near Jumeirah Garden City and major landmarks such as Sheikh Zayed Road, Downtown Dubai, and City Walk, ENSO provides residents with an exquisite living environment....",
    "needsTranslation": true
  },
  {
    "name": "East & West Properties",
    "descriptionEn": "Welcome to East and West Properties (EWP), a distinguished developer at the forefront of luxury real estate across the UAE and beyond. Established in 1993, EWP has become synonymous with opulence and refined living, offering a discreet haven for those with an eye for excellence.Our journey as a deve...",
    "needsTranslation": true
  },
  {
    "name": "El Prime",
    "descriptionEn": "EL PRIME PROPERTIES' founders have been dedicated to the growth and prosperity of the UAE for over five decades, contributing significantly to various sectors including Logistics, Trading & Investment, Aviation, and Real Estate development since 1970. Their tireless efforts have been instrumental in...",
    "needsTranslation": true
  },
  {
    "name": "Ellington",
    "descriptionEn": "Founded in 2014, Ellington Properties is Dubai's leading design-led real estate developer and endeavours to craft beautiful properties and communities for high-quality lifestyles. A truly customer-centric developer in UAE, we develop beautiful residences designed by incredible artistry and impeccabl...",
    "needsTranslation": true
  },
  {
    "name": "Elysian Development",
    "descriptionEn": "Elysian Developments is a boutique luxury real estate developer based in Dubai, conceived by the visionaries at Elysian Group — a company with a strong legacy in the Dubai property market since 2006. Guided by a philosophy that every detail matters, Elysian is committed to delivering residential env...",
    "needsTranslation": true
  },
  {
    "name": "Emaar Properties",
    "descriptionEn": "Emaar Properties is one of the world’s most valuable and admired real estate development companies. With proven competencies in properties, shopping malls & retail and hospitality & leisure, Emaar shapes new lifestyles with a focus on design excellence, build quality and timely delivery.",
    "needsTranslation": false
  },
  {
    "name": "Emerald Palace Group",
    "descriptionEn": "Emerald Palace Group (EPG) is an international real estate developer with a legacy dating back to 1996. Over the years, the company has successfully delivered more than 40 large-scale residential projects across Ukraine, the UAE, and Russia, completing over 10,000 homes across more than one million ...",
    "needsTranslation": true
  },
  {
    "name": "Emirates National Investment",
    "descriptionEn": "Emirates National Investment (ENI) is an investment company with a diversified portfolio including real estate, construction, agriculture and industry in the UAE, as well as in the Middle East and Africa.Founded in 1982 by Dr. Mohammed Khalfan Bin Herbash, ENI was founded during a period of extraord...",
    "needsTranslation": true
  },
  {
    "name": "Empire Developments",
    "descriptionEn": "Embark on a journey of luxury and refinement as you elevate your lifestyle to unparalleled heights at Empire Developments. Our commitment to excellence ensures an extraordinary living experience, where opulence meets innovation. Welcome to a realm where every moment, every detail, and every space tr...",
    "needsTranslation": true
  },
  {
    "name": "Esnaad Real Estate Development",
    "descriptionEn": "Since its inception, ESNAAD Developments has been a vitalsubsidiary of UAE-based AuraHoldings - a prominent player inthe real estate and constructionsector.",
    "needsTranslation": true
  },
  {
    "name": "Ever Glory Developments",
    "descriptionEn": "Our vision is to uplift our clients, partners and Ever Glory General Trading LLC (Formerly known as Wealth Creation General Trading LLC) established on 2021, is a privately owned company originated in Dubai, UAE.Ever Glory General Trading LLC has made a remarkable name in International Trading of St...",
    "needsTranslation": true
  },
  {
    "name": "Expo City",
    "descriptionEn": "Expo City Dubai will ensure the far-reaching legacy of Expo 2020 continues to evolve and flourish for generations to come. This clean, tech-enabled city will propel human progress by harnessing the power of ‘we’. Expo City Dubai is based on a deep-rooted belief that a broad coalition of people, work...",
    "needsTranslation": true
  },
  {
    "name": "Fakhruddin Properties",
    "descriptionEn": "Fakhruddin Properties founded in 2003, is a renowned property development, property management, brokerage and hospitality management organization that offers end-to-end property solutions. We have steadily grown an international portfolio of residential and commercial projects in the UAE, the UK, an...",
    "needsTranslation": true
  },
  {
    "name": "Fortimo",
    "descriptionEn": "Fortimo Group AG is a Swiss based real estate company. We develop, hold and operate our own properties with passion since the year 2000.In 2015, we ventured to Dubai and opened our first UAE residential building in 2019, followed by a hotel 2 years later and now we are very pleased to present our th...",
    "needsTranslation": true
  },
  {
    "name": "Forum Real Estate Development",
    "descriptionEn": "Forum Real Estate Development, an international developer acclaimed for its end-to-end real estate development cycle, has been pioneering in Dubai's market since 2015. The company not only focuses on enhancing the quality and consumer appeal of its properties but also acts as an investor in a variet...",
    "needsTranslation": true
  },
  {
    "name": "GFS Developments",
    "descriptionEn": "GFS Developments have been in the industry for over 25 years and are involved in real estate and construction, delivering quality residential & commercial property. Bearing a commitment to development, quality, & timely delivery, GFS has built a reputation for excellence in design and construction. ...",
    "needsTranslation": true
  },
  {
    "name": "GHD Developments",
    "descriptionEn": "GHD Real Estate Development is the real estate development arm of the group with the vision of developing modern and premium dwellings.. We aim to develop quality residential and commercial projects offering exceptional value. We have positioned ourselves as a niche developer executing limited but p...",
    "needsTranslation": true
  },
  {
    "name": "Ginco Properties",
    "descriptionEn": "The management of GINCO PROPERTIES (GP) is based on the company's belief in providing 360° real estate management services so that clients can benefit from a holistic living experience. Under the guidance of GP management, a calm and stylish lifestyle is always guaranteed. We are pioneers in managin...",
    "needsTranslation": true
  },
  {
    "name": "Gisaura Group",
    "descriptionEn": "Gisaura Group is an independent private equity firm based in the rapidly growing financial center of MENA Market. will focus on strategically and tactically capitalizing on the evolving investment landscape in the Gulf Cooperation Council countries and particularly in Angola. We are deal hunters, of...",
    "needsTranslation": true
  },
  {
    "name": "Golden Woods",
    "descriptionEn": "Golden Woods Real Estate Development is a reputable family-owned business that was established in 2013 and is headquartered in Dubai. Specializing in a diverse range of exceptional projects, the company is committed to excellence by blending innovation and expertise to produce inspiring and enduring...",
    "needsTranslation": true
  },
  {
    "name": "Green Group",
    "descriptionEn": "Green Group is a sustainability driven & client focused real estate development company in Dubai, UAE. Using sustainable management in practice, Green Group is all about pioneering sustainability and innovation in real estate industry by building architecturally unique, striking and sustainable resi...",
    "needsTranslation": true
  },
  {
    "name": "Green Horizon Development",
    "descriptionEn": "Green Horizon Developments has been redefining luxury living in Dubai for over 15 years, creating premium residential and commercial spaces in prestigious locations. The company blends modern architecture, sustainability and meticulous attention to detail to deliver homes and communities that stand ...",
    "needsTranslation": true
  },
  {
    "name": "Green Yard Properties Development",
    "descriptionEn": "Green Yard Properties Development one of the leading real-estate developers, working primarily towards developing sustainable and eco-friendly projects. In a bid to save nature and maintain the eco-balance, the developer is using cutting-edge technologies to create something truly unique and excepti...",
    "needsTranslation": true
  },
  {
    "name": "Grovy Real Estate Development",
    "descriptionEn": "Grovy is a trusted real estate developer committed to delivering quality, value, and customer-centric experiences. Grovy Developers, established in the UAE, has been at the forefront of the real estate industry, recognized for crafting projects that blend luxury, functionality, and modern design. Si...",
    "needsTranslation": true
  },
  {
    "name": "Gulf Land Property Developers",
    "descriptionEn": "After years of existence, Gulf Land Property Developers is today a player in the real estate market in the UAE. Our know-how in real estate has been recognized for many years thanks to the diversity of our expertise and the success of our projects.We invest in the territories, enhance their attracti...",
    "needsTranslation": true
  },
  {
    "name": "H&H Development",
    "descriptionEn": "H&H Development was founded in 2007 by Shahab Lutfi and Mohamed Al Hussaini. Through its business units, H&H offers a wide range of real estate-related services, ranging from real estate development to property management and rental, property management, furniture and decoration procurement and inte...",
    "needsTranslation": true
  },
  {
    "name": "HMB Homes",
    "descriptionEn": "Based in Dubai, HMB Properties is a recognized real estate specialist. Founded in 2008, the company provides comprehensive services such as real estate management, marketing, sale, purchase, consulting and investment consulting.The company is expanding rapidly and strives to address international cl...",
    "needsTranslation": true
  },
  {
    "name": "HRE Development",
    "descriptionEn": "HRE Development was originally established as a construction company and has evolved over the past 22 years into a premier real estate developer in the UAE. Backed by our in-house construction arm, we transitioned into real estate development three years ago, ensuring our projects are built with pre...",
    "needsTranslation": true
  },
  {
    "name": "HVM Living",
    "descriptionEn": "The HVM Group’s journey in business began in India, with the humble beginnings of a cattle farm and dairy business. Haji Vali Matliwala, the patriarch of the family, built a successful business by providing dairy products to the local community in the year 1950.Haji Vali’s son, Haji Ibrahim Matliwal...",
    "needsTranslation": true
  },
  {
    "name": "HZ DEVELOPMENT",
    "descriptionEn": "HZ Development is a leading real estate developer dedicated to excellence, professionalism, and ethical conduct in every transaction. The company’s commitment to providing high-quality services is built on a solid foundation of deep market knowledge, unwavering integrity, and a client-first approach...",
    "needsTranslation": true
  },
  {
    "name": "Hamrk Real Estate Development",
    "descriptionEn": "Hamrk Real Estate Development is a company involved in construction based in Dubai.",
    "needsTranslation": true
  },
  {
    "name": "Hayaat Developments",
    "descriptionEn": "Our single-minded aim is for Hayaat Developments to be recognised as Dubai’s most innovative and trusted developer. To achieve this, we are committed to creating bespoke luxury properties that finely balance form and function. Combining aesthetic beauty with thoughtful design to create wholly liveab...",
    "needsTranslation": true
  },
  {
    "name": "IGO",
    "descriptionEn": "Indigo Valley Inc Limited is a renowned real estate developer based in Dubai, known for its innovative and high-quality projects. The company is committed to creating exceptional living spaces that combine luxury, comfort, and sustainability. With a strong emphasis on architectural excellence and cu...",
    "needsTranslation": true
  },
  {
    "name": "IKR Development",
    "descriptionEn": "IKR Development is a developer with over 30 years of construction experience, originating in Pakistan and now actively expanding in Dubai. The company focuses on architectural expressiveness, quality, and innovation, aiming to create residential spaces that combine aesthetics and functionality.Curre...",
    "needsTranslation": true
  },
  {
    "name": "Iman Developers",
    "descriptionEn": "It was back in 2016 when the first brick of the Iman Developers was laid, and since then we haven’t looked back. We stepped into the real estate development industry in the UAE with the objective to set high quality standards in residential housing for Emirati and foreign families.The innovative and...",
    "needsTranslation": true
  },
  {
    "name": "Imtiaz",
    "descriptionEn": "Over the last decades, the Asian and Middle Eastern economies have encountered various exhilarating and challenging phases with tremendous growth. We at Imtiaz Developments are proud to be a part of this magnifying business environment since 1993 and are determined to sustain our contribution toward...",
    "needsTranslation": true
  },
  {
    "name": "Iraz Developments",
    "descriptionEn": "Iraz Developments, at the core of its inception, reflects the dynamic evolution of the UAE. Co-founded by Mr. Irfan Khokar and Mr. Hassan Raza, who have been instrumental in watching the UAE's market transition from a burgeoning commercial center to a global hub. Their combined experience of over 28...",
    "needsTranslation": true
  },
  {
    "name": "Irth Development ",
    "descriptionEn": "IRTH embodies the essence of legacy, anchoring its roots in the heart of a vibrant Dubai. As a part of a distinguished local family conglomerate, our privately held real estate investment platform draws strength from a heritage spanning over a century.At IRTH, our foundation is built upon three CORE...",
    "needsTranslation": true
  },
  {
    "name": "Januss Developers",
    "descriptionEn": "Founded on the principles of balance, tranquility, and sustainability, Januss Real Estate Developers is a forward-thinking company that blends heritage with modern design. Drawing inspiration from timeless values, Januss Developers strive to create harmonious spaces that enhance well-being and offer...",
    "needsTranslation": true
  },
  {
    "name": "Kamdar Developments",
    "descriptionEn": "Your dream our commitmentKamdar Developments, boasting over 40 years of global expertise, is a leader in innovative and high-quality real estate projects. Specializing in residential, commercial, and industrial developments, we are dedicated to sustainability, value, and positive community impact.Ou...",
    "needsTranslation": true
  },
  {
    "name": "Kappa Acca Real Estate Development",
    "descriptionEn": "The developer Kappa Acca Real Estate Development is part of the Khamas Group of companies. It is a leading and respected construction company in the UAE, implementing projects in the residential and commercial real estate segments. The landmark projects of the Kappa Acca Real Estate Development comp...",
    "needsTranslation": true
  },
  {
    "name": "Karma Development",
    "descriptionEn": "Karma Developers have successfully established a prominent presence in the fiercely competitive mid-size development sphere within the rapidly expanding real estate sector of the United Arab Emirates.Pioneering Multilocational Excellence: Our expertise extends to mastering complex, multilocational p...",
    "needsTranslation": true
  },
  {
    "name": "Kasco Real Estate Development",
    "descriptionEn": "KASCO Development has been a leading force in real estate development since its inception. We specialize in creating unique residential and commercial projects across various sectors. Our comprehensive property services encompass construction, development, sales, buying, and leasing – offering a com...",
    "needsTranslation": true
  },
  {
    "name": "LIV",
    "descriptionEn": "Zaya Living Real Estate Development is a boutique real estate developer, founded in 2008 by Nadia Zaal and Khalifa Bin Butti. The company focuses on building communities with a soul, combining nature-inspired designs with meticulous attention to detail. Zaya successfully completed the iconic Nurai I...",
    "needsTranslation": true
  },
  {
    "name": "Lapis Properties",
    "descriptionEn": "Lapis Properties is a Dubai-based real estate development company with over 12 years of experience in the real estate markets of the Middle East and Turkey. The company specializes in the creation of premium residential and commercial properties that combine innovative design, high-quality construct...",
    "needsTranslation": true
  },
  {
    "name": "Laraix",
    "descriptionEn": "With a strong foundation since 2016, Laraix Group has built a proven track record of quality, innovation, and trust across multiple industries. Our commitment to excellence and ethical business practices has earned us a reputation as a reliable and forward-thinking organization. Leveraging decades o...",
    "needsTranslation": true
  },
  {
    "name": "Leos Development",
    "descriptionEn": "LEOS is a world-class international property and lifestyle developer with in the UK, the UAE and internationally. Headquartered in Weybridge, Surrey in the UK, with offices in London and a state-of-the art experience centre in Dubai, LEOS is dedicated to delivering excellence through design in the r...",
    "needsTranslation": true
  },
  {
    "name": "London Gate",
    "descriptionEn": "London Gate is a well-known real estate developer who brings timeless elegance of London to the dynamic urban landscape of Dubai. What was born in 2014 as an ambitious vision of creating truly exceptional living conditions is now being realized.Building on our experience of providing exceptional pro...",
    "needsTranslation": true
  },
  {
    "name": "Loutraki Real Estate",
    "descriptionEn": "Loutraki Real Estate L.L.C is a prominent developer that operates as an extension of the renowned Nucorp Constructions group, a well-established entity that has successfully delivered over AUD 500 million worth of projects in the residential and commercial property sectors in Australia since 2011. W...",
    "needsTranslation": true
  },
  {
    "name": "MAG Property Development",
    "descriptionEn": "MAG Property Development is part of Al Gaddah (MAG) Group, a multinational conglomerate based in the UAE. With 40 years of experience, MAG Group is one of the largest corporations in the region, occupying a leading position among its colleagues in the field of real estate, contracting, engineering, ...",
    "needsTranslation": true
  },
  {
    "name": "MAK Developers",
    "descriptionEn": "MAK, a visionary in Dubai’s real estate development combines design excellence and research insights to revolutionize the industry. Born from Al Hadaf Holdings, MAK crafts elegantly designed spaces, blending sophistication with functionality. With a foundation strengthened by seasoned industry partn...",
    "needsTranslation": true
  },
  {
    "name": "MIRFA",
    "descriptionEn": "Mirfa IBC, a new entrant in the Dubai real estate market, aims to redefine modern living by offering quality luxury homes at affordable prices. Despite the lack of affordable luxury homes, Mirfa IBC goes above and beyond to provide affordable luxury residences. They also offer financing options that...",
    "needsTranslation": true
  },
  {
    "name": "MS Homes",
    "descriptionEn": "MS Homes, a premier real estate brokerage in Dubai, is renowned for curating exceptional lifestyles rather than just selling properties. With a commitment to redefining luxury living in Dubai, MS Homes stands as a symbol of unparalleled design and sophisticated residential properties. Our journey st...",
    "needsTranslation": true
  },
  {
    "name": "Maakdream Properties",
    "descriptionEn": "MAAKDREAM is the real estate brand of the future, born on the basis of the legacy of MAAKSONS Engineering Corporation Ltd. With over 70 years of experience in implementing megaprojects of national importance, MAAKDREAM was created to bring the same discipline, quality and further planning to the wor...",
    "needsTranslation": true
  },
  {
    "name": "Madar Developments",
    "descriptionEn": "A design and development arm of the construction powerhouse - Al Madar Engineering. Madar Developments exemplifies the unwavering dedication to quality and innovation synonymous with the legacy brand of Al Madar. At Madar Developments, our mission is to create properties that defy conventions, deliv...",
    "needsTranslation": true
  },
  {
    "name": "Main Realty",
    "descriptionEn": "Main Realty is a development company specializing in the creation of high-quality residential and commercial properties in Dubai and the United States. The company is known for its attention to detail, modern architectural solutions, and commitment to excellence in every project. Main Realty activel...",
    "needsTranslation": true
  },
  {
    "name": "Majid Al Futtaim",
    "descriptionEn": "Across our residential communities, our goal is to inspire our residents to live life to the fullest by continually providing unique and engaging experiences to current and future generations.For over two decades, Majid Al Futtaim has delivered great moments – starting with City Centre Deira in 1995...",
    "needsTranslation": true
  },
  {
    "name": "Majid Developments",
    "descriptionEn": "Majid Developments has been at the forefront of the Middle East luxury real estate market since 2004. Founded by Mansoor Majid, we are on a mission to create sustainable, vibrant communities where people thrive and connect. With a legacy of over 20 years, we’ve redefined the art of real estate devel...",
    "needsTranslation": true
  },
  {
    "name": "Manam RED",
    "descriptionEn": "Founded in 2024, Manam Real Estate Development LLC is a leader in the UAE’s real estate market, recognized for its focus on luxury and functionality in design. With a foundation built on extensive market knowledge and 30 years of residential and commercial project development experience in Oman, we ...",
    "needsTranslation": true
  },
  {
    "name": "Marquis",
    "descriptionEn": "Marquis is the premium real estate developer in Dubai, UAE, with exquisitely designed luxury apartments that aren’t just places to live in, but a lifestyle. We ensure personalized service throughout, from the inception to the handover of a project.We strive to utilize every element at our disposal t...",
    "needsTranslation": true
  },
  {
    "name": "Mashriq Elite Real Estate Development",
    "descriptionEn": "Mashriq Group - your trusted partner in Real Estate, Project Development, and Telecommunication. With over two decades of experience, we have become pioneers in these industries, having network not only in the UAE but also across United States, Europe, Singapore, Saudi Arabia, and the wider region.O...",
    "needsTranslation": true
  },
  {
    "name": "Me Do Re",
    "descriptionEn": "Me Do Re Properties is a Dubai-based real estate developer. The company was founded in 2018 by a group of real estate experts with a vision to create innovative and sustainable communities in Dubai.Me Do Re Properties has a portfolio of projects that includes a mix of residential, commercial, and mi...",
    "needsTranslation": true
  },
  {
    "name": "Meraas",
    "descriptionEn": "Meraas is a Dubai—based holding company founded in 2007, which is one of the largest developers in the city. For the construction of buildings, Meraas applies innovations to ensure a comfortable life for the residents of Dubai.",
    "needsTranslation": false
  },
  {
    "name": "Mered",
    "descriptionEn": "MERED is an international real estate developerwith it’s headquarters in Dubai. We design anddevelop innovative, high-end destinations thatenrich people's lives.We are more than just a premium real estate developer. We are a carefully curated collective of industry experts, including designers, arch...",
    "needsTranslation": true
  },
  {
    "name": "Metac Development",
    "descriptionEn": "Founded in 1987, Metac Development is part of Metac General Contracting Company — a leading ISO/ICV-certified construction and real estate development firm in the UAE. With over three decades of experience, the company has built a strong reputation through quality-driven, client-focused operations a...",
    "needsTranslation": true
  },
  {
    "name": "Meteora",
    "descriptionEn": "A Meteora home is your ticket to elevated living. Everything around you meets the highest standards; for it has been conceived, designed and personalised with precision, passion and your dreams in mind.Meteora Developers creates premium residential developments that combine high-quality design with ...",
    "needsTranslation": true
  },
  {
    "name": "Mill Hill",
    "descriptionEn": "Mill Hill is a distinguished property developer with an impressive 20-year track record in both the UK and UAE markets. Their portfolio includes a diverse array of high-profile projects, from 5-star hotels in Central London to expensive apartment developments in Birmingham, as well as opulent villas...",
    "needsTranslation": true
  },
  {
    "name": "Mr. Eight",
    "descriptionEn": "For over 12 years, our team has been creating eco-systems and buildings that people truly want to call home. We have operated across Europe, and now, we’re expanding our reach, beginning our journey in Dubai.At Mr. Eight we believe that every building should embody a unique concept with its own dist...",
    "needsTranslation": true
  },
  {
    "name": "Muraba Properties",
    "descriptionEn": "Muraba Properties is a boutique development company based in Dubai, specializing in creating unique residential projects with a focus on minimalism, architectural excellence, and harmony with the surrounding environment. The company collaborates with world-renowned architects, including Pritzker Pri...",
    "needsTranslation": true
  },
  {
    "name": "Myra Properties",
    "descriptionEn": "We are designing homes for families providing optimum living comfort, ease of maintenance, quality construction and giving birth to a home of your dreams. Our prime objective is to deliver best returns for your investments. Without compromising on quality alongside maximizing the returns on your inv...",
    "needsTranslation": true
  },
  {
    "name": "NABNI",
    "descriptionEn": "We are NABNI, a boutique real estate developer, where visionary design converges with unwavering integrity, innovation, and meticulous attention to detail. We reshape the luxury real estate experience by crafting living spaces that not only redefine standards but also resonate with the essence of cu...",
    "needsTranslation": true
  },
  {
    "name": "NED Properties",
    "descriptionEn": "NED® Properties is the real estate branch of NED Investment Group that specializes in the leasing and management of self-owned residential and commercial properties under the company’s portfolio.",
    "needsTranslation": true
  },
  {
    "name": "Nakheel",
    "descriptionEn": "Based in Dubai, Nakheel is a leading global developer whose innovative, iconic projects form an iconic portfolio of master communities and residential, retail, hotel and leisure facilities that are crucial to realizing Dubai's vision. Nakheel's coastal projects, including the world-renowned, award-w...",
    "needsTranslation": false
  },
  {
    "name": "New MFOUR Real Estate Development",
    "descriptionEn": "Founded in 2010, MFOUR Development has grown from a construction contracting firm into a leading real estate developer, delivering landmark projects across Mumbai and Pune, including Aura Heights and Ocean View. The renowned company is expanding into Dubai with the debut of a premium, mid-rise resid...",
    "needsTranslation": true
  },
  {
    "name": "Nexus",
    "descriptionEn": "We take a holistic approach to our projects, utilizing our full capabilities to ensure the best possible project execution. We have got apassionate team to deliver the best possible outcomes. At our core, we believe in fulfilling our promises and providing excellent products that our clients can tru...",
    "needsTranslation": true
  },
  {
    "name": "Nine Developments",
    "descriptionEn": "Nine Developments is a forward-thinking and highly diversified company with a strategic focus on business growth across multiple sectors. Specializing in Real Estate Investments, Consulting & Service Management, and Mergers and Acquisitions, the company has established itself as a leader in business...",
    "needsTranslation": true
  },
  {
    "name": "Nshama",
    "descriptionEn": "Nshama Company is a young, rapidly developing developer from Dubai, who is actively conquering the market and has earned a brilliant reputation as a reliable partner who always fulfills his obligations. The foundation date of the organization is considered to be 2014, when Fred Durie, who previously...",
    "needsTranslation": true
  },
  {
    "name": "Nuri Living",
    "descriptionEn": "At Nuri Living, we believe homes are more than structures — they are sanctuaries for the human spirit. Rooted in a legacy of sustainable, thoughtful development, our story began with a single vision: to create living environments where luxury, balance, and well-being coexist naturally.From the found...",
    "needsTranslation": true
  },
  {
    "name": "Object One",
    "descriptionEn": "Our 10-year experience in construction has transformed into a great mission to create objects that will turn the city into a gallery of modern art.This is not only about the spectacular exterior, but also about the sensations inside each object.\"Being a head taller\" is part of our philosophy. That's...",
    "needsTranslation": true
  },
  {
    "name": "Oksa Developer",
    "descriptionEn": "OKSA Developers bridges the gap between dreams and reality. With a presence in the key global market of UAE, we are redefining real estate through innovative designs, uncompromising quality, and a commitment to building spaces where people and communities thrive. As a forward-thinking real estate de...",
    "needsTranslation": true
  },
  {
    "name": "Omniyat",
    "descriptionEn": "OMNIYAT is one of the most visionary privately held real-estate development and service groups in the Gulf Region. Since 2005, OMNIYAT has created living canvases of residential, commercial, hospitality and retail spaces for a one-of-a-kind premium experience.As a global leader in luxury lifestyle, ...",
    "needsTranslation": false
  },
  {
    "name": "One Development",
    "descriptionEn": "One Development is a homegrown boutique real estate developer dedicated to creating modern living spaces that foster a sense of community and connection. Our customer-centric approach ensures a unique and fulfilling experience for every resident.",
    "needsTranslation": true
  },
  {
    "name": "Orange.Life!",
    "descriptionEn": "Orange.Life! is part of Orange Group, a prominent investmentand development company represented in Russia, Germany and UAE.Orange.Life! in UAE is an investment center located in Dubai.Company provide comprehensive transaction, support, encompassing payment processing,legal documentation, interior se...",
    "needsTranslation": true
  },
  {
    "name": "Orra Developers",
    "descriptionEn": "Orra Development, based in Dubai strives to offer luxury-oriented residential projects that are conceived and designed primarily for locals and expatriates. The developer is focused on creating a viable environment for residents looking for homes that are set in a tranquil and serene environment.Mos...",
    "needsTranslation": true
  },
  {
    "name": "Palladium Development",
    "descriptionEn": "Company with a big history, experience in development and investment. Palladium Development delivers a total solution to all kinds of Real Estate projects, from initial concept through completion and handover to after sale maintenance and support.",
    "needsTranslation": true
  },
  {
    "name": "Palma Development",
    "descriptionEn": "Palma Development is a subsidiary of Palma Holding. Thanks to its four support units: Palma Development, Palma Investment, Palma Real Estate and Palma Asset Management, Palma Holding offers unsurpassed, exclusive, customer-oriented services and individual development in Dubai's first-class real esta...",
    "needsTranslation": true
  },
  {
    "name": "Pantheon",
    "descriptionEn": "Pantheon Development was born from a simple yet powerful vision—to create homes that not only stand as architectural masterpieces but also serve as vibrant, thriving communities. Founded by Kalpesh Kinariwala, Pantheon began with the recognition of a gap in the Dubai real estate market: the need for...",
    "needsTranslation": true
  },
  {
    "name": "Pasha 1",
    "descriptionEn": "Pasha1 is a Dubai-based real estate developer born from the long-standing legacy of PJS Global, a family business with over four decades of success in international trade, agro-processing, logistics, industrial ventures and asset management. Backed by operations in nine countries, fourteen offices a...",
    "needsTranslation": true
  },
  {
    "name": "Pearlshire",
    "descriptionEn": "Pearlshire is a dynamic and innovative property developer dedicated to transforming landscapes and shaping lives through their impactful projects. Specializing in high-quality, value-added investments in real estate, distressed assets, and debt-equity strategies, Pearlshire Capital Group strives to ...",
    "needsTranslation": true
  },
  {
    "name": "Pinnacle A K S Real Estate Development",
    "descriptionEn": "Pinnacle AKS Real Estate Development is a construction-related company operating in Dubai.",
    "needsTranslation": true
  },
  {
    "name": "Prescott Development",
    "descriptionEn": "Prescott Development is a Dubai-based developer specializing in the construction of residential properties with a focus on sustainability and high-quality standards.The company began its operations in 2006, concentrating its efforts on the development of residential projects in Dubai.Developer's pro...",
    "needsTranslation": true
  },
  {
    "name": "Prestige One",
    "descriptionEn": "Since 2007, Prestige has been a name at the forefront of Dubai Real Estate, with multibillion dirham investments, we have placed integrity, transparency and delivering on commitments at the heart of what we do. Prestige One Developments is a premier Dubai real estate developer focused on the custome...",
    "needsTranslation": true
  },
  {
    "name": "RSG Group",
    "descriptionEn": "The RSG difference is innovation, integrity, and unsurpassed quality. What began as a humble family business in automotive spare parts more than 70 years ago, is now a world-class organization with successful businesses in sectors as diverse as Automotive, Real Estate, Industrial Equipment, Investme...",
    "needsTranslation": true
  },
  {
    "name": "Rabdan Real Estate Developments",
    "descriptionEn": "At Rabdan Developments , we transcend the ordinary to redefine luxury living in Dubai. Our commitment to excellence is evident in every project we undertake. We seamlessly blend high-end luxury with sophisticated design, setting a new benchmark in comfort and leisure. As a leading Dubai developer, w...",
    "needsTranslation": true
  },
  {
    "name": "Range Developments",
    "descriptionEn": "Range Developments is a premier luxury property developer with a formidable portfolio exceeding $1 billion, spanning four countries. Renowned for their ultra-luxurious 5-star hotels, including the Park Hyatt St. Kitts, InterContinental Dominica and Six Senses La Sagesse, Grenada, Range is synonymous...",
    "needsTranslation": true
  },
  {
    "name": "Reef Luxury Developments",
    "descriptionEn": "At Reef Developments, we are a pioneering developer in Dubai focused on transforming living spaces through innovative and practical solutions. Our commitment to delivering exceptional quality and meticulous attention to detail ensures that every project is completed on time, elevating the real estat...",
    "needsTranslation": true
  },
  {
    "name": "Regent Developments",
    "descriptionEn": "At Regent Developments, we create inspiring homes that foster harmony and deepen residents' connection to nature, delivering living spaces that truly enhance quality of life. Our homes are designed not only to fit your needs today, but to fit your needs even after 10 years — and that’s what makes us...",
    "needsTranslation": true
  },
  {
    "name": "Reportage",
    "descriptionEn": "With over 20 years of experience, Reportage Properties is one of the largest private developers in the United Arab Emirates, with projects in Abu Dhabi, Dubai, and now Egypt.We are focused and consistent in our objective to provide innovative, modern, and affordable housing solutions that not only o...",
    "needsTranslation": true
  },
  {
    "name": "Rijas Developers",
    "descriptionEn": "It started as a small trading enterprise in 1966, has grown into a global business empire with a diversified investment portfolio Textile Manufacturing, Export, Air Logistics, Retail, Poultry Farms, Real Estate Development & many other businesses. The group focus has been on creating brand that add ...",
    "needsTranslation": true
  },
  {
    "name": "Rokane",
    "descriptionEn": "Established since 1988 by a visionary leader as a general contracting company Rokane Group, Inc. provides high quality professional services in the field of design, engineering, management and construction; ensuring complete customers satisfaction that exceed expectations along all project phases. W...",
    "needsTranslation": true
  },
  {
    "name": "SAAS",
    "descriptionEn": "Established in 2020, SAAS Properties is a boutique firm which builds on decades of commercial experience and world-class design-build expertise to become one of the most sought-after luxury developers in the UAE.We build our homes and spaces to merge harmoniously with their well-appointed surroundin...",
    "needsTranslation": true
  },
  {
    "name": "SCC Vertex Development",
    "descriptionEn": "SCC Vertex is a modern development company founded in 2024, based in Dubai. It is a part of SCC Group, which has over 30 years of experience in construction, engineering and infrastructure projects in India, the Middle East and Africa.The company specializes in luxury residential real estate, focusi...",
    "needsTranslation": true
  },
  {
    "name": "SOHO Development ",
    "descriptionEn": "We are glad to provide to you the Luxury properties in Dubai. We have an expertise in Dubai properties, appreciate our clients and offer to them the best service. Above all, we are passionate about delivering unparalleled experiences.",
    "needsTranslation": true
  },
  {
    "name": "SOL Properties",
    "descriptionEn": "SOL Properties, cultivated under the patronage of the Bhatia Group since 1975, emerges as a visionary in Dubai’s Property Development Sector, with a portfolio of over 250 transformative projects. As a guiding light for those seeking a brighter life, SOL fosters growth and vibrancy through innovative...",
    "needsTranslation": true
  },
  {
    "name": "Safe Developers",
    "descriptionEn": "Safe Developers is a property development company established by Silgo Group of Companies to build not just property but to build dream Homes.Even though, Safe Developers is a new company launching its first project, the actual picture is much bigger. Safe Developers is next stage in a natural progr...",
    "needsTranslation": true
  },
  {
    "name": "Sama Ezdan",
    "descriptionEn": "Sama Ezdan provides 360 degrees Development and investment approach to deliver the best investment in Real Estate.",
    "needsTranslation": true
  },
  {
    "name": "Samana",
    "descriptionEn": "Samana Developers is one of the fastest growing private developers in the country with their focus being on delivering the promise to each and every customer of a quality product at an appropriate price point that maximizes the returns for investors.",
    "needsTranslation": true
  },
  {
    "name": "Sankari Property",
    "descriptionEn": "Sankari Properties presents a collection of luxury real estate steeped in a rich family legacy. The enterprise extends beyond the conventional boundaries of real estate, intertwining a story of tradition and excellence. As a growing contributor to the UAE’s dynamic development, Sankari Properties br...",
    "needsTranslation": true
  },
  {
    "name": "Segrex Development",
    "descriptionEn": "Segrex Development has been developing exclusive projects in Dubai since 2015. The company is managed by a team of top managers with extensive experience in the construction and implementation of residential projects with a total area of ​​more than 500,000 sq.m. in Dubai and more than 1 Millions of...",
    "needsTranslation": true
  },
  {
    "name": "Select Group",
    "descriptionEn": "Founded in 2002, Select Group is a dynamic and diverse corporation with premium property development at its core. Select Group operates a portfolio of investments in various sectors across the Middle East, the United Kingdom and Europe, supported by a global talent pool of over 750 employees. Select...",
    "needsTranslation": true
  },
  {
    "name": "Seven Tides",
    "descriptionEn": "Founded in 2004, Seven Tides is a premier luxury real estate developer with a diversified portfolio that includes exceptional residential, commercial, and resort properties in some of the world's most sought-after locations. As a privately-owned holding company, Seven Tides is committed to crafting ...",
    "needsTranslation": true
  },
  {
    "name": "Shaikhani Group",
    "descriptionEn": "The Shaikhani Group of Companies aims to enhance the quality of life by creating and developing world-class properties and attendant infrastructure. The Shaikhani Group achieves its success by maintaining strong ties with people at all levels, both within and outside the organization. We continuousl...",
    "needsTranslation": true
  },
  {
    "name": "Shakirov Developments",
    "descriptionEn": "Over the years, we’ve had the privilege of delivering a wide range of landmark projects that reflect our commitment to quality, innovation, and functionality. From luxury hospitality to advanced industrial facilities, each development tells its own story of purpose-driven design and engineering exce...",
    "needsTranslation": true
  },
  {
    "name": "Shapoorji Pallonji",
    "descriptionEn": "For over 150 years, Shapoorji Pallonji has been at the forefront of construction and engineering. Many of our early projects have stood the test of time and serve as monuments to our age-old legacy.It’s our ability to take on projects of scale and complexity and our ability to deliver consistently t...",
    "needsTranslation": true
  },
  {
    "name": "Signature Developers",
    "descriptionEn": "Signature Developers, a Dubai based real estate company is founded and established by the Regal Group and the Lals Group. It is one of the few companies that have successfully set a precedent by opting for innovation, high quality, and service. Despite remaining rooted in heritage and respecting the...",
    "needsTranslation": true
  },
  {
    "name": "Siroya Ventures Realty",
    "descriptionEn": "Headquartered in Dubai, ROYA Lifestyle Developments stands as a beacon in the ultra-luxury real estate sector. With over 30 years’ combined expertise in both the public and private sectors, we are adept at crafting ultra-luxury residences for refined living.Our emphasis is on innovative design, coup...",
    "needsTranslation": true
  },
  {
    "name": "Skyline Builders",
    "descriptionEn": "For 35 years, Skyline Builders has been Kerala's unrivaled builder in market share and trust. Our journey began in 1989 with an unshakable focus on customer satisfaction and unwavering commitment. The pivotal year 1990-1991 marked our consistent and expansive growth, leading to excellence and recogn...",
    "needsTranslation": true
  },
  {
    "name": "Sobha",
    "descriptionEn": "We are an international luxury real estate developer committed to redefining the art of living by building sustainable communities.Founded in 1976 by PNC Menon, a legendary innovator in the real estate industry, as an interior design business in Oman, we have established our presence all over the wo...",
    "needsTranslation": true
  },
  {
    "name": "Stamn Development",
    "descriptionEn": "About STAMNSTAMN Real Estate Development is an independent overseas subsidiary of New Bay Holdings, a group company headquartered in Nanchang, Jiangxi, China, with 30 years of comprehensive development experience; The group company was established in 1993.",
    "needsTranslation": true
  },
  {
    "name": "Svarn Development",
    "descriptionEn": "Svarn is a real estate developer based in the UAE. With a wealth of experience, we have established ourselves as leaders in the field, harnessing our expertise in real estate development and business management.",
    "needsTranslation": true
  },
  {
    "name": "Swiss Property",
    "descriptionEn": "Swiss real estate strives for perfection. We work in the center of the culture of excellence and promotion to ensure the highest standard of management.Every improvement made with an eye to what needs to happen is an enterprise of lasting value. We combine earthly attractions and amenities as much a...",
    "needsTranslation": true
  },
  {
    "name": "Symbolic Developments",
    "descriptionEn": "Symbolic Developments is a boutique real estate developer that is part of the Speedex Group, a multinational conglomerate based in Dubai with a 30-year legacy. We specialise in the premium segment of the real estate industry, offering homes of optimum quality in family-oriented communities that enha...",
    "needsTranslation": true
  },
  {
    "name": "Tabeer",
    "descriptionEn": "In the fast-paced, cosmopolitan city of Dubai, the real estate market is as dynamic as the skyline. Here, luxury and innovation are the norms, not the exception. Against this vibrant backdrop, Tabeer Real Estate Development has been making its mark since its establishment in 2014, In the fast-paced,...",
    "needsTranslation": true
  },
  {
    "name": "Taraf",
    "descriptionEn": "Taraf is a boutique property developer and asset manager based in the UAE. With a unique approach to craftingdesign-led,high-quality properties.Taraf is reshaping the concept ofluxury living for its clients by offeringexclusivity and exceptional lifestyle opportunities in elevated living environment...",
    "needsTranslation": true
  },
  {
    "name": "Tarrad Development",
    "descriptionEn": "Tarrad Development is an innovative real estate development company based in Dubai, established in 2004. The company specializes in creating high-quality residential and commercial properties, combining modern design, sustainable technologies, and comfortable living environments. Tarrad Development ...",
    "needsTranslation": true
  },
  {
    "name": "Tasmeer Indigo Properties",
    "descriptionEn": "At Tasmeer Indigo Properties, we're pioneering a new era of urban living tailored for today's generation. Our meticulously designed spaces offer millennials everything essential to thrive—modern amenities like co-working spaces, gyms, and dynamic community hubs. Beyond real estate, we're committed t...",
    "needsTranslation": true
  },
  {
    "name": "Tebyan Real Estate Development Enterprises",
    "descriptionEn": "Tebyan Real Estate Development Enterprises L.L.C is the consolidation of the track records and experiences of several major real estate investors and developers under one umbrella. The track record includes several hotels, residential, commercial, and entertainment projects in Saudi Arabia, Jordan, ...",
    "needsTranslation": true
  },
  {
    "name": "The First Group",
    "descriptionEn": "Over the past two decades, we have forged a reputation as one of the hospitality industry’s leading innovators, providing groundbreaking investment opportunities to clients and partners and exceptional, memorable experiences to hotel and leisure guests.Today, our high-value hospitality asset portfol...",
    "needsTranslation": true
  },
  {
    "name": "The Heart of Europe",
    "descriptionEn": "The Heart of Europe is a heart–shaped archipelago consisting of 6 unique themed islands: St. Petersburg, Sweden, Switzerland, The Floating Venice, Germany and Main Europe. Each island will give you the opportunity to plunge into the culture of different countries and experience an unforgettable expe...",
    "needsTranslation": true
  },
  {
    "name": "The 100",
    "descriptionEn": "The 100 is a property developer that contributes to the development of Dubai through innovative and high-quality residential projects. The 100 is committed to creating residential complexes that meet the highest quality standards and meet the needs of modern residents.",
    "needsTranslation": true
  },
  {
    "name": "Tiger Properties",
    "descriptionEn": "TIGER GROUP was founded in the year 1976 with an inspiring vision of the founders to effectively participate in the building of the United Arab Emirates through delivering landmark projects to the highest possible quality standard that exceed our customers’ expectations. Throughout our success journ...",
    "needsTranslation": true
  },
  {
    "name": "Tomorrow World Properties",
    "descriptionEn": "Tomorrow World is a boutique real estate developer established in 2022 in Dubai and is part of Tomorrow World Group, a leading trading conglomerate with a 20-year legacy (since 2002). The company focuses on premium residential projects, including developments on the Dubai Islands, with a strong emph...",
    "needsTranslation": true
  },
  {
    "name": "TownX",
    "descriptionEn": "TownX Development is a real estate development company in Dubai, United Arab Emirates. They offer attractions with villas, luxury apartments and new smart homes with affordable payment plans without any commission. They develop projects related to the commercial and residential sectors. They offer l...",
    "needsTranslation": true
  },
  {
    "name": "Tranquil Infra Developers",
    "descriptionEn": "Founded by a visionary team of industry veterans, Tranquil Infra Developers stands at the forefront of reshaping Dubai's skyline. As one of the top real estate developers in Dubai, we harness quality, innovation, and sustainability to create value for investors and enhance the communities we serve. ...",
    "needsTranslation": true
  },
  {
    "name": "True Future Real Estate Development",
    "descriptionEn": "True Future Real Estate Development Company, a Dubai, UAE-based company focused on building and villa projects. We are a leader in the real estate sector.We specialize in developing and constructing luxury construction projects, including buildings and villas, and aim to provide exceptional resident...",
    "needsTranslation": true
  },
  {
    "name": "Tuscany",
    "descriptionEn": "Tuscany Real Estate Development is a Dubai-based company founded in 2022, devoted to cultivating a prominent presence in the real estate market and asserting itself as a premier entity in the UAE. The company upholds a steadfast commitment to completing projects within designated timelines while uph...",
    "needsTranslation": true
  },
  {
    "name": "Uniestate Properties",
    "descriptionEn": "UniEstate is a master real estate developer with over 28 years of experience since 1995 in the UAE. With a focus on excellence in development, contracting, and customer service, Unit state has built a reputation for delivering real value to its customers across the Emirates.",
    "needsTranslation": true
  },
  {
    "name": "Urban Properties",
    "descriptionEn": "As a prominent figure in the realm of real estate development within the UAE, Urban Properties proudly occupies the vanguard position. Through a series of remarkably triumphant projects, we have undeniably cemented our reputation as a steadfast and forward-looking management entity in the developmen...",
    "needsTranslation": true
  },
  {
    "name": "Valores Property Development",
    "descriptionEn": "Valores Development is a real estate development company founded by seasoned visionaries with over three decades of expertise in the industry. Their passion lies in creating sustainable, community-focused spaces that enhance the lifestyle of residents.Inspired by nature, Valores believes in translat...",
    "needsTranslation": true
  },
  {
    "name": "Vantage Developments",
    "descriptionEn": "At Vantage Developments, a premier property developer in Dubai, we specialize in crafting luxury apartments across the city. By blending modern design with functionality, we create developments that offer enriching lifestyles. Moreover, we integrate smart technology, green spaces, and premium amenit...",
    "needsTranslation": true
  },
  {
    "name": "Vantage Ventures",
    "descriptionEn": "Vantage Ventures Real Estate Development is a boutique real estate developer operating in Dubai and Singapore. Spearheaded by Evan Lim-Penta, a renowned contractor and developer, Vantage Ventures is committed to delivering high-quality properties that meet the highest standards of craftsmanship and ...",
    "needsTranslation": true
  },
  {
    "name": "Vincitore",
    "descriptionEn": "Vincitore Realty is Dubai’s Finest Bespoke Real Estate Development Company offering passionately designed Iconic Landmark Projects. The company takes pride in being recognized as a Designer Boutique Real Estate Developer in Dubai.Our primary goal is to offer Affordable Luxury Homes, enabling our nic...",
    "needsTranslation": true
  },
  {
    "name": "Vision Developments",
    "descriptionEn": "Gold Vision Developments Ltd is a construction-related company operating in Dubai.",
    "needsTranslation": true
  },
  {
    "name": "WADAN Developments",
    "descriptionEn": "WADAN Developments is a fast-growing real estate developer in Dubai, established in 2025. We create homes that are more than just beautiful spaces — they are designed to bring comfort, wellness, and smart technology together.Our team has international experience in Qatar, Pakistan, and Afghanistan. ...",
    "needsTranslation": true
  },
  {
    "name": "WELL Concept RED",
    "descriptionEn": "WELL Concept RED is a dynamically developing real estate company specializing in residential and commercial projects. Striving to create modern, comfortable and sustainable objects focused on the needs of clients. Our team of professionals ensures a high level of quality at every stage of developmen...",
    "needsTranslation": true
  },
  {
    "name": "WOW RED",
    "descriptionEn": "World of Wonders Real Estate Development also named as Wow Red is a privately owned developer community globally. Its vision is to design a lifestyle designed experience for residents in a series of world-class destination worldwide.Providing a premium quality and interiors brand with Sbe's brand na...",
    "needsTranslation": true
  },
  {
    "name": "Wasl",
    "descriptionEn": "Born from the vision to elevate Dubai's global prominence, Wasl was founded on May 25, 2008, with the mission to transform the city into an even more captivating destination for residents, businesses, and visitors alike. Created from the union of the Dubai Development Board and Real Estate Departmen...",
    "needsTranslation": true
  },
  {
    "name": "Yas Developers",
    "descriptionEn": "Y A S Developers FZE stands at the forefront of Dubai's dynamic real estate landscape, setting new benchmarks for luxury living through innovative and modern design, crafting exceptional living experiences. Our brand is synonymous with individuality, sophistication, and practicality, transcending th...",
    "needsTranslation": true
  },
  {
    "name": "Zimaya Properties",
    "descriptionEn": "Our mission is to create living environments that enrich lives and bring daily fulﬁlment, empowering individuals as they pursue their dreams and ambitions.Zimaya Properties brings together seasoned industry professionals boasting over threedecades of construction and development expertise across the...",
    "needsTranslation": true
  }
]